export const familyNames = [
  '김',
  '이',
  '박',
  '최',
  '정',
  '강',
  '조',
  '윤',
  '장',
  '임',
  '한',
  '오',
  '서',
  '신',
  '권',
  '황',
  '안',
  '송',
  '류',
  '전',
];

export const firstNameParts = [
  '준',
  '민',
  '서',
  '지',
  '현',
  '우',
  '동',
  '혁',
  '성',
  '영',
  '수',
  '희',
  '은',
  '진',
  '아',
  '승',
  '윤',
  '정',
  '주',
  '연',
  '태',
  '경',
  '재',
  '원',
  '종',
  '훈',
];

// 인천 지역
export const incheonDistricts = [
  '미추홀구',
  '연수구',
  '남동구',
  '부평구',
  '계양구',
  '서구',
  '동구',
  '중구',
];

export const incheonRoads = [
  '인주대로',
  '매소홀로',
  '경원대로',
  '청라대로',
  '연수대로',
  '미추홀대로',
  '길주로',
  '봉수대로',
  '연남로',
];

// 부천 지역
export const bucheonDistricts = ['원미구', '소사구', '오정구'];
export const bucheonRoads = [
  '부일로',
  '소사로',
  '부천로',
  '옥길로',
  '심곡로',
  '경인로',
  '소새울로',
  '원미로',
];

export const occupations = [
  // 전문직
  '의사',
  '변호사',
  '약사',
  '회계사',
  '건축사',

  // 회사원
  '회사원',
  '은행원',
  '공무원',
  '사무직',
  '영업직',
  '인사담당자',
  '마케팅팀장',
  '기획자',

  // IT
  '프로그래머',
  '웹개발자',
  '시스템엔지니어',
  'DB관리자',
  'UX디자이너',

  // 교육
  '교사',
  '교수',
  '학원강사',
  '보육교사',
  '특수교사',

  // 서비스
  '요리사',
  '미용사',
  '부동산중개사',
  '보험설계사',
  '간호사',

  // 자영업
  '자영업자',
  '음식점운영',
  '카페운영',
  '슈퍼마켓운영',
  '온라인쇼핑몰운영',

  // 프리랜서/예술
  '프리랜서',
  '작가',
  '디자이너',
  '예술가',
  '연구원',

  // 무급/봉사 활동
  '주부',
  '전업주부',
  '학생',
  '대학생',
  '취업준비생',
  '자원봉사자',
  '시민단체활동가',

  // 은퇴/기타
  '무직',
  '은퇴',
  '프리랜서',
  '아르바이트',
];

export const churchNames = [
  '사랑의교회',
  '은혜교회',
  '믿음교회',
  '소망교회',
  '축복교회',
  '성광교회',
  '중앙교회',
  '신일교회',
  '제일교회',
  '한빛교회',
  '새생명교회',
  '복된교회',
  '평화교회',
  '영광교회',
  '생명교회',
];
